"use client"
import React from "react";


const Rules = () => {

    return (<div>
        <p className={'text-center'}>
            ДОГОВІР ПУБЛІЧНОЇ ОФЕРТИ ПРО НАДАННЯ ІНФОРМАЦІЙНИХ ПОСЛУГ В ОНЛАЙН-КУРСАХ
            в межах онлайн кусру
        </p>


        <p>
            Цей Договір публічної оферти ("Договір") є офіційною пропозицією приватного підприємця Макогон Сніжани
            Рінатівни
            (“Виконавець”) надавати інформаційні послуги в онлайн-курсі ("Послуги").
            Відповідно до статті 633 Цивільного кодексу України повним або частковим прийняттям (акцепт) умов цього
            договору
            є оплата Послуг та реєстрація фізичної особи (“Замовник”) на платформі softbook. З моменту акцепту цей
            договір
            вважається укладеним, а Виконавець зобов’язується надати Послуги на умовах, визначених цим договором.
        </p>
        1. ПРЕДМЕТ ДОГОВОРУ<br/>
        1.1. Надання послуг за цим Договором здійснюється в рамках участі Замовником у онлайн-курсі. Послуги<br/>
        передбачають надання Замовнику доступу до матеріалів онлайн-курсу.<br/>
        1.2. Матеріали онлайн-курсу представлені у вигляді текстових, графічних, аудіо- та відеофайлів, які розміщені на<br/>
        платформі [softbook] та доступні для перегляду Замовником після оплати Послуг.<br/>
        1.3. Надання доступу до матеріалів Курсу відбувається одразу після повної оплати через особистий кабінет.<br/>
        2. УМОВИ І ПОРЯДОК НАДАННЯ ПОСЛУГ<br/>
        2.1. Послуги, зазначені в п. 1.1 цього Договору, надаються Замовнику дистанційно шляхом передачі Замовнику<br/>
        інформаційних матеріалів, а також за допомогою телекомунікаційної мережі Інтернет через платформу.<br/>
        2.2. Після акцепту Оферти, так само як і внесення оплати за Послуги, Замовник отримує доступ до Особистого<br/>
        кабінету на Сайті Виконавця і надалі зобов'язується беззастережно приймати Послуги Виконавця - виконуючи<br/>
        поставлені завдання в порядку і строки, обумовлені цим Договором.<br/>
        2.3. Взаємодія Сторін здійснюється через Особистий кабінет Замовника. Виконавець отримує завдання,
        рекомендації<br/>
        та роз'яснення Виконавця у відповідних розділах Особистого кабінету і самостійно визначає спосіб і час для їх
        виконання.<br/>
        2.4. Доступ до матеріалів Курсу надається Замовнику з моменту оплати. Залежно від виду Курсу Виконавець надає
        доступ до матеріалів Курсу на певний строк, що визначається у кожному окремому порядку, інформація про що
        розміщується на Офіційних джерелах інформування. Строк доступу до Курсу може бути збільшено за взаємною згодою
        Виконавця та Замовника у випадку виявлення у Замовника відповідних медичних протипоказань (переломи, травми,
        захворювання несумісні з фізичним навантаженням) у випадку пред’явлення медичних документів, що підтверджують
        наявність таких протипоказань, складеними уповноваженими на те закладами охорони здоров’я.<br/>
        2.5. Використання матеріалів Курсу можливе тільки для особистого користування, без передачі доступу третім
        особам, поширення та копіювання.<br/>
        2.6. У разі порушення умов, передбачених п. 2.5, розмір збитків буде встановлено в судовому порядку.<br/>
        2.7. Послуги вважаються наданими належним чином і в повному обсязі за Договором з моменту отримання Замовником в
        Особистому кабінеті інформаційних матеріалів Виконавця.<br/>

        3. ПРАВА ТА ОБОВ'ЯЗКИ СТОРІН <br/>
        3.1. Замовник має право:<br/>
        3.1.1. Вимагати належного і своєчасного надання Послуг Виконавцем.<br/>
        3.1.2. Отримувати від Виконавця інформацію з питань організації та забезпечення належного надання послуг.<br/>
        3.1.3. Звертатися до Виконавця з усіх питань, пов'язаних з наданням Послуг.<br/>
        3.1.4. Вимагати від Виконавця дотримання конфіденційності персональних даних.<br/>
        3.2. Замовник зобов'язується:<br/>
        3.2.1. Сплачувати вартість Курсу відповідно до умов цього Договору.<br/>
        3.2.2. Гарантувати Виконавцю, що:<br/>
        • повністю ознайомився з умовами Оферти,<br/>
        • повністю розуміє предмет Оферти і характер наданих Послуг,<br/>
        • укладає договір добровільно.<br/>
        3.2.3. Не передавати свої дані для входу на платформу третім особам.<br/>
        3.2.4. Не використовувати інформацію, отриману від Виконавця способами, здатними привести до завдавання збитків
        інтересам Виконавця.<br/>
        3.3. Виконавець має право:<br/>
        3.3.1. Вимагати від Замовника своєчасної та повної оплати Послуг.<br/>
        3.3.2. Самостійно визначати форми і методи надання Послуг виходячи з вимог законодавства, а також конкретних
        умов Договору.<br/>
        3.3.3. Вносити зміни до програми, умов та вартості Послуг, повідомляючи про це Замовника за допомогою Джерел
        інформування.<br/>
        3.3.4. Припинити надання послуг Замовнику та припинити дію цього Договору в односторонньому порядку в разі
        порушення Замовником своїх зобов'язань відповідно до цього Договору та законодавства України.
        3.4. Виконавець зобов'язується:<br/>
        3.4.1. Надати Замовнику Послуги належної якості та в повному обсязі.<br/>
        3.4.2. Нести відповідальність за достовірність інформації, що міститься в матеріалах онлайн-курсу.<br/>
        3.4.3. Інформувати Замовника про всі зміни в умовах надання послуг та про всі доповнення вчасно.<br/>
        3.4.4. Надавати на запит Замовника доступ до інформації про надання послуг.<br/>
        3.4.5. Використовувати всі особисті дані і іншу конфіденційну інформацію про Замовника тільки для надання
        Послуг.<br/>
        3.4.6. Не передавати і не показувати третім особам документацію та інформацію про Замовника, що знаходиться у
        нього в доступі.<br/>
        4. ПЕРСОНАЛЬНІ ДАНІ<br/>
        4.1. Замовник надає Виконавцю свої персональні дані, такі як: ім’я, прізвище, електронна пошта, номер телефону
        для виконання цього Договору.<br/>
        4.2. Замовник погоджується на зберігання та обробку своїх персональних даних Виконавцем з метою надання Послуг,
        ведення обліку та статистики, а також інформування Замовника про новини, акції та спеціальні пропозиції від
        Виконавця.<br/>
        4.3. Виконавець зобов’язується дотримуватися конфіденційності персональних даних Замовника та не передавати їх
        третім особам без згоди Замовника, за винятком випадків, передбачених чинним законодавством України.<br/>
        4.4. Замовник має право в будь-який момент вимагати видалення своїх персональних даних з бази даних Виконавця,
        написавши про це на електронну пошту Виконавця.<br/>
        4.5. Згода на обробку персональних даних дається Замовником шляхом акцепту умов цього Договору.<br/>
        5. ВІДПОВІДАЛЬНІСТЬ СТОРІН<br/>
        5.1. Виконавець не несе відповідальності за збитки, які можуть бути заподіяні Замовнику або третім особам
        внаслідок:<br/>
        • неправильного розуміння Замовником методичних рекомендацій, викладених в інформаційних і (або) аналітичних
        матеріалах, а також рекомендаціях;<br/>
        • неможливості доступу до платформи або платіжної системи через технічні проблеми, не
        пов’язані з Виконавцем;<br/>
        • дій третіх особ, які призвели до порушення конфіденційності персональних даних Замовника.<br/>
        5.2. Виконавець не несе відповідальності за невідповідність матеріалів Курсу очікуванням Замовника.<br/>
        5.3. Замовник несе відповідальність за збитки, які можуть бути заподіяні Виконавцю або третім особам внаслідок:
        • порушення Замовником умов користування платформою та (або) платіжною системою ;<br/>
        • передачі Замовником своїх даних для входу на платформу третім особам;<br/>
        • використання Замовником матеріалів онлайн-курсу для комерційних цілей, поширення або копіювання.<br/>
        6. ОБСТАВИНИ НЕПЕРЕБОРНОЇ СИЛИ<br/>
        6.1. Сторони звільняються від відповідальності за часткове або повне невиконання зобов'язань за цим Договором,
        якщо це невиконання стало наслідком обставин непереборної сили, що виникли після укладення цього Договору
        внаслідок обставин надзвичайного характеру, які Сторони не могли передбачити або запобігти, а саме: пожежа,
        стихійне лихо, війна і військові дії всіх видів, цивільні і національні хвилювання, блокада транспорту,
        прийняття органами влади і управління актів, що перешкоджають виконанню умов цього Договору та інші обставини,
        що знаходяться поза розумним контролем Сторони, а так само збої, що виникають в телекомунікаційних і
        енергетичних мережах.<br/>
        6.2. Сторона, яка потрапила під дії обставин непереборної сили, зобов'язана негайно, протягом 3 (трьох) робочих
        днів, в письмовій формі повідомити іншу Сторону про настання таких обставин з наданням документа уповноваженого
        державного органу про передбачуваний термін їх дії і припинення дії.<br/>
        6.3. У разі виникнення обставин непереборної сили термін виконання зобов'язань за цим Договором відсувається
        відповідно до часу, протягом якого діють такі обставини і їх наслідки. Якщо обставини непереборної сили будуть
        існувати понад 3 (трьох) місяців поспіль, будь-яка Сторона матиме право розірвати Договір в односторонньому
        порядку.<br/>
        7. ОПЛАТА ПОСЛУГ<br/>
        7.1. Оплата за надання інформаційних послуг проводиться через систему.<br/>
        7.2. Оплата Послуг здійснюється в повному обсязі без передплати до початку надання послуг.<br/>
        7.3. Замовник здобуває право користуватися Послугами після оплати вартості Курсу.<br/>
        8. ПОВЕРНЕННЯ КОШТІВ<br/>
        8.1. У разі неможливості надання послуг Виконавцем з його вини, Замовник має право на повернення коштів у
        повному обсязі.<br/>
        8.2. Для отримання коштів Замовник повинен звернутися до Виконавця з відповідною заявою протягом 14 календарних
        днів з моменту оплати послуг.<br/>
        8.3. Виконавець зобов'язаний повернути кошти Замовнику протягом 30 календарних днів з моменту отримання
        заяви.<br/>
        8.4. У разі відмови Замовника від послуг з його вини, кошти не повертаються.<br/>
        8.5. Заява може бути направлена Виконавцю в електронному вигляді.<br/>
        8.6. Зразок заяви про повернення коштів можна знайти на Сайті Виконавця.<br/>
        9. ІНШІ УМОВИ<br/>
        9.1. Оферта є публічною та адресована будь-якій фізичній (або юридичній) особі, яка бажає отримати доступ до
        матеріалів Курсу.<br/>
        9.2. Цей договір укладається в електронному вигляді та має юридичну силу відповідно до статтей 11, 633, 641 ЦКУ.
        9.3. Цей Договір регулюється і тлумачиться відповідно до законодавства України.<br/>
        9.4. Цей договір набирає чинності з моменту акцепту Замовником умов цього договору.<br/>
        9.5. Жодна зі Сторін не може передати свої права та обов'язки за Договором третім особам.<br/>
        9.6. Виконавець залишає за собою право внести зміни в умови Оферти і/або відкликати Оферту в будь-який момент на
        свій розсуд. У разі внесення Виконавцем змін в Оферту, такі зміни вступають в силу з моменту розміщення
        відповідного повідомлення на сайті.<br/>
        9.7. Замовник погоджується і визнає, що внесення змін до Оферту тягне за собою внесення цих змін до укладеного і
        діючий між Замовником та Виконавцем Договір, і ці зміни в Договорі вступають в силу одночасно з такими змінами в
        Оферті.<br/>
        9.8. Договір може бути розірваний за згодою Сторін в будь-який час або з інших підстав, передбачених цією
        Офертою і/або чинним Законодавством України.<br/>
        9.9. Усі спори та розбіжності, що можуть виникнути між сторонами за цим договором, вирішуються шляхом
        переговорів. У разі недосягнення згоди спори вирішуються в судовому порядку за місцезнаходженням Виконавця
        відповідно до чинного законодавства України.<br/>
        9.10. Сторони визнають, що документи, надіслані за допомогою Особистого кабінету чи іншими електронними засобами
        зв'язку, мають юридичну силу, рівноцінну документам при звичайному паперовому документообігу.
        9.11. У разі визнання будь-якого положення Оферти недійсним або неправочинним, це не впливає на дію інших
        положень Оферти.<br/>
        9.12. Оферта діє до повного виконання Сторонами своїх зобов'язань.<br/>
        9.13. Офіційним джерелом інформування Замовника про Виконавця та послуги є:<br/>

        • Telegram-канал Виконавця: <a href={'https://t.me/yaninapopesko'}>Yanina Popesko Telegram</a><br/>
        • <a href="#" className={'cta-link inline-flex items-center text-primary raspberry-color'} onClick={() => {
        window.open("mailto:" + atob("eWFuaW5hcG9wZXNrb0BnbWFpbC5jb20="), '_blank', "noopener")?.focus();
    }}>Пошта Яніни Попеско</a><br/>

        • Instagram-аккаунт Виконавця: <a href={'https://www.instagram.com/yanina_popesko/'}>Yanina Popesko
        Instagram</a>

    </div>)
}

export default Rules