"use client"
import React from "react";


const Rules = () => {

    return (<div>
        <p className={'font-bold'}>ДОГОВІР ПУБЛІЧНОЇ ОФЕРТИ ПРО НАДАННЯ ІНФОРМАЦІЙНИХ ПОСЛУГ В ОНЛАЙН-КУРСАХ в межах онлайн кусру</p>
        <p>Цей Договір публічної оферти (&quot;Договір&quot;) є офіційною пропозицією приватного підприємця Макогон
            Сніжани Рінатівни (&ldquo;Виконавець&rdquo;) надавати інформаційні послуги в онлайн-курсі
            (&quot;Послуги&quot;). Відповідно до статті 633 Цивільного кодексу України повним або частковим прийняттям
            (акцепт) умов цього договору є оплата Послуг та реєстрація фізичної особи (&ldquo;Замовник&rdquo;) на
            платформі. З моменту акцепту цей договір вважається укладеним, а Виконавець зобов&rsquo;язується надати
            Послуги на умовах, визначених цим договором.</p>
        <br/>
        <br/>
        <p className={'font-bold'}>1. ПРЕДМЕТ ДОГОВОРУ</p>
        <br/>
        <p><span className={'font-bold'}>1.1.</span> Надання послуг за цим Договором здійснюється в рамках участі Замовником у онлайн-курсі. Послуги
            передбачають надання Замовнику доступу до матеріалів онлайн-курсу.</p>
        <p><span className={'font-bold'}>1.2.</span> Матеріали онлайн-курсу представлені у вигляді текстових, графічних, аудіо- та відеофайлів, які розміщені
            на</p>
        <p>платформі та доступні для перегляду Замовником після оплати Послуг.</p>
        <p><span className={'font-bold'}>1.3.</span> Надання доступу до матеріалів Курсу відбувається одразу після повної оплати через особистий кабінет.</p>
        <br/>
        <br/>
        <p className={'font-bold'}>2. УМОВИ І ПОРЯДОК НАДАННЯ ПОСЛУГ</p>
        <br/>
        <p><span className={'font-bold'}>2.1.</span> Послуги, зазначені в п. <span className={'font-bold'}>1.1</span> цього Договору, надаються Замовнику дистанційно шляхом передачі
            Замовнику інформаційних матеріалів, а також за допомогою телекомунікаційної мережі Інтернет через
            платформу.</p>
        <p><span className={'font-bold'}>2.2.</span> Після акцепту Оферти, так само як і внесення оплати за Послуги, Замовник отримує доступ до
            Особистого кабінету на Сайті Виконавця і надалі зобов&apos;язується беззастережно приймати Послуги Виконавця
            - виконуючи поставлені завдання в порядку і строки, обумовлені цим Договором.</p>
        <p><span className={'font-bold'}>2.3.</span> Взаємодія Сторін здійснюється через Особистий кабінет Замовника. Виконавець отримує завдання,
            рекомендації та роз&apos;яснення Виконавця у відповідних розділах Особистого кабінету і самостійно визначає
            спосіб і час
            для їх виконання.</p>
        <p><span className={'font-bold'}>2.4.</span> Доступ до матеріалів Курсу надається Замовнику з моменту оплати. Залежно від виду Курсу Виконавець надає
            доступ до матеріалів Курсу на певний строк, що визначається у кожному окремому порядку, інформація про що
            розміщується на Офіційних джерелах інформування. Строк доступу до Курсу може бути збільшено за взаємною
            згодою Виконавця та Замовника у випадку виявлення у Замовника відповідних медичних протипоказань (переломи,
            травми, захворювання несумісні з фізичним навантаженням) у випадку пред&rsquo;явлення медичних документів,
            що підтверджують наявність таких протипоказань, складеними уповноваженими на те закладами охорони
            здоров&rsquo;я.</p>
        <p><span className={'font-bold'}>2.5.</span> Використання матеріалів Курсу можливе тільки для особистого користування, без передачі доступу третім
            особам, поширення та копіювання.</p>
        <p><span className={'font-bold'}>2.6.</span> У разі порушення умов, передбачених п. 2.5, розмір збитків буде встановлено в судовому порядку.</p>
        <p><span className={'font-bold'}>2.7.</span> Послуги вважаються наданими належним чином і в повному обсязі за Договором з моменту отримання
            Замовником в Особистому кабінеті інформаційних матеріалів Виконавця.</p>
        <br/>
        <br/>
        <p className={'font-bold'}>3. ПРАВА ТА ОБОВ&apos;ЯЗКИ СТОРІН</p>
        <br/>
        <p><span className={'font-bold'}>3.1.</span> Замовник має право:</p>
        <p><span className={'font-bold'}>3.1.1.</span> Вимагати належного і своєчасного надання Послуг Виконавцем.</p>
        <p><span className={'font-bold'}>3.1.2.</span> Отримувати від Виконавця інформацію з питань організації та забезпечення належного надання послуг.</p>
        <p><span className={'font-bold'}>3.1.3.</span> Звертатися до Виконавця з усіх питань, пов&apos;язаних з наданням Послуг.</p>
        <p><span className={'font-bold'}>3.1.4.</span> Вимагати від Виконавця дотримання конфіденційності персональних даних.</p>
        <p><span className={'font-bold'}>3.2. </span>Замовник зобов&apos;язується:</p>
        <p><span className={'font-bold'}>3.2.1.</span> Сплачувати вартість Курсу відповідно до умов цього Договору.</p>
        <p><span className={'font-bold'}>3.2.2.</span> Гарантувати Виконавцю, що:</p>
        <p>&bull; повністю ознайомився з умовами Оферти,</p>
        <p>&bull; повністю розуміє предмет Оферти і характер наданих Послуг,</p>
        <p>&bull; укладає договір добровільно.</p>
        <p><span className={'font-bold'}>3.2.3.</span> Не передавати свої дані для входу на платформу третім особам.</p>
        <p><span className={'font-bold'}>3.2.4.</span> Не використовувати інформацію, отриману від Виконавця способами, здатними привести до завдавання
            збитків інтересам Виконавця.</p>
        <p><span className={'font-bold'}>3.3.</span> Виконавець має право:</p>
        <p><span className={'font-bold'}>3.3.1.</span> Вимагати від Замовника своєчасної та повної оплати Послуг.</p>
        <p><span className={'font-bold'}>3.3.2.</span> Самостійно визначати форми і методи надання Послуг виходячи з вимог законодавства, а також конкретних
            умов Договору.</p>
        <p><span className={'font-bold'}>3.3.3.</span> Вносити зміни до програми, умов та вартості Послуг, повідомляючи про це Замовника за допомогою Джерел
            інформування.</p>
        <p><span className={'font-bold'}>3.3.4.</span> Припинити надання послуг Замовнику та припинити дію цього Договору в односторонньому порядку в разі
            порушення Замовником своїх зобов&apos;язань відповідно до цього Договору та законодавства України. 3.4.
            Виконавець зобов&apos;язується:</p>
        <p><span className={'font-bold'}>3.4.1.</span> Надати Замовнику Послуги належної якості та в повному обсязі.</p>
        <p><span className={'font-bold'}>3.4.2.</span> Нести відповідальність за достовірність інформації, що міститься в матеріалах онлайн-курсу.</p>
        <p><span className={'font-bold'}>3.4.3.</span> Інформувати Замовника про всі зміни в умовах надання послуг та про всі доповнення вчасно.</p>
        <p><span className={'font-bold'}>3.4.4.</span> Надавати на запит Замовника доступ до інформації про надання послуг.</p>
        <p><span className={'font-bold'}>3.4.5.</span> Використовувати всі особисті дані і іншу конфіденційну інформацію про Замовника тільки для надання
            Послуг.</p>
        <p><span className={'font-bold'}>3.4.6.</span> Не передавати і не показувати третім особам документацію та інформацію про Замовника, що знаходиться у
            нього в доступі.</p>
        <br/>
        <br/>
        <p className={'font-bold'}>4. ПЕРСОНАЛЬНІ ДАНІ</p>
        <br/>
        <p><span className={'font-bold'}>4.1.</span> Замовник надає Виконавцю свої персональні дані, такі як: ім&rsquo;я, прізвище, електронна пошта, номер
            телефону для виконання цього Договору.</p>
        <p><span className={'font-bold'}>4.2.</span> Замовник погоджується на зберігання та обробку своїх персональних даних Виконавцем з метою надання
            Послуг, ведення обліку та статистики, а також інформування Замовника про новини, акції та спеціальні
            пропозиції від Виконавця.</p>
        <p><span className={'font-bold'}>4.3.</span> Виконавець зобов&rsquo;язується дотримуватися конфіденційності персональних даних Замовника та не
            передавати їх третім особам без згоди Замовника, за винятком випадків, передбачених чинним законодавством
            України.</p>
        <p><span className={'font-bold'}>4.4.</span> Замовник має право в будь-який момент вимагати видалення своїх персональних даних з бази даних
            Виконавця, написавши про це на електронну пошту Виконавця.</p>
        <p><span className={'font-bold'}>4.5.</span> Згода на обробку персональних даних дається Замовником шляхом акцепту умов цього Договору.</p>
        <br/>
        <br/>
        <p className={'font-bold'}>5. ВІДПОВІДАЛЬНІСТЬ СТОРІН</p>
        <br/>
        <p><span className={'font-bold'}>5.1.</span> Виконавець не несе відповідальності за збитки, які можуть бути заподіяні Замовнику або третім особам
            внаслідок:</p>
        <p>&bull; неправильного розуміння Замовником методичних рекомендацій, викладених в інформаційних і (або)
            аналітичних матеріалах, а також рекомендаціях;</p>
        <p>&bull; неможливості доступу до платформи або платіжної системи через технічні проблеми, не пов&rsquo;язані з
            Виконавцем;</p>
        <p>&bull; дій третіх особ, які призвели до порушення конфіденційності персональних даних Замовника.</p>
        <p><span className={'font-bold'}>5.2.</span> Виконавець не несе відповідальності за невідповідність матеріалів Курсу очікуванням Замовника.</p>
        <p><span className={'font-bold'}>5.3.</span> Замовник несе відповідальність за збитки, які можуть бути заподіяні Виконавцю або третім особам
            внаслідок: &bull; порушення Замовником умов користування платформою та (або) платіжною системою ;</p>
        <p>&bull; передачі Замовником своїх даних для входу на платформу третім особам;</p>
        <p>&bull; використання Замовником матеріалів онлайн-курсу для комерційних цілей, поширення або копіювання.</p>
        <br/>
        <br/>
        <p className={'font-bold'}>6. ОБСТАВИНИ НЕПЕРЕБОРНОЇ СИЛИ</p>
        <br/>
        <p><span className={'font-bold'}>6.1.</span> Сторони звільняються від відповідальності за часткове або повне невиконання зобов&apos;язань за цим
            Договором, якщо це невиконання стало наслідком обставин непереборної сили, що виникли після укладення цього
            Договору внаслідок обставин надзвичайного характеру, які Сторони не могли передбачити або запобігти, а саме:
            пожежа, стихійне лихо, війна і військові дії всіх видів, цивільні і національні хвилювання, блокада
            транспорту, прийняття органами влади і управління актів, що перешкоджають виконанню умов цього Договору та
            інші обставини, що знаходяться поза розумним контролем Сторони, а так само збої, що виникають в
            телекомунікаційних і енергетичних мережах.</p>
        <p><span className={'font-bold'}>6.2.</span> Сторона, яка потрапила під дії обставин непереборної сили, зобов&apos;язана негайно, протягом 3 (трьох)
            робочих днів, в письмовій формі повідомити іншу Сторону про настання таких обставин з наданням документа
            уповноваженого державного органу про передбачуваний термін їх дії і припинення дії.</p>
        <p><span className={'font-bold'}>6.3.</span> У разі виникнення обставин непереборної сили термін виконання зобов&apos;язань за цим Договором
            відсувається відповідно до часу, протягом якого діють такі обставини і їх наслідки. Якщо обставини
            непереборної сили будуть існувати понад 3 (трьох) місяців поспіль, будь-яка Сторона матиме право розірвати
            Договір в односторонньому порядку.</p>
        <br/>
        <br/>
        <p className={'font-bold'}>7. ОПЛАТА ПОСЛУГ</p>
        <br/>
        <p><span className={'font-bold'}>7.1.</span> Оплата за надання інформаційних послуг проводиться через систему.</p>
        <p><span className={'font-bold'}>7.2.</span> Оплата Послуг здійснюється в повному обсязі без передплати до початку надання послуг.</p>
        <p><span className={'font-bold'}>7.3.</span> Замовник здобуває право користуватися Послугами після оплати вартості Курсу.</p>
        <br/>
        <p className={'font-bold'}>8. ПОВЕРНЕННЯ КОШТІВ</p>
        <p><span className={'font-bold'}>8.1.</span> У разі неможливості надання послуг Виконавцем з його вини, Замовник має право на повернення коштів у
            повному обсязі.</p>
        <p><span className={'font-bold'}>8.2.</span> Для отримання коштів Замовник повинен звернутися до Виконавця з відповідною заявою протягом 14
            календарних днів з моменту оплати послуг.</p>
        <p><span className={'font-bold'}>8.3.</span> Виконавець зобов&apos;язаний повернути кошти Замовнику протягом 30 календарних днів з моменту отримання
            заяви.</p>
        <p><span className={'font-bold'}>8.4.</span> У разі відмови Замовника від послуг з його вини, кошти не повертаються.</p>
        <p><span className={'font-bold'}>8.5.</span> Заява може бути направлена Виконавцю в електронному вигляді.</p>
        <p><span className={'font-bold'}>8.6.</span> Зразок заяви про повернення коштів можна знайти на Сайті Виконавця.</p>
        <br/>
        <br/>
        <p className={'font-bold'}>9. ІНШІ УМОВИ</p>
        <br/>
        <p><span className={'font-bold'}>9.1.</span> Оферта є публічною та адресована будь-якій фізичній (або юридичній) особі, яка бажає отримати доступ до
            матеріалів Курсу.</p>
        <p><span className={'font-bold'}>9.2.</span> Цей договір укладається в електронному вигляді та має юридичну силу відповідно до статтей 11, 633, 641
            ЦКУ. <span className={'font-bold'}>9.3.</span> Цей Договір регулюється і тлумачиться відповідно до законодавства України.</p>
        <p><span className={'font-bold'}>9.4.</span> Цей договір набирає чинності з моменту акцепту Замовником умов цього договору.</p>
        <p><span className={'font-bold'}>9.5.</span> Жодна зі Сторін не може передати свої права та обов&apos;язки за Договором третім особам.</p>
        <p><span className={'font-bold'}>9.6.</span> Виконавець залишає за собою право внести зміни в умови Оферти і/або відкликати Оферту в будь-який момент
            на свій розсуд. У разі внесення Виконавцем змін в Оферту, такі зміни вступають в силу з моменту розміщення
            відповідного повідомлення на сайті.</p>
        <p><span className={'font-bold'}>9.7.</span> Замовник погоджується і визнає, що внесення змін до Оферту тягне за собою внесення цих змін до
            укладеного і діючий між Замовником та Виконавцем Договір, і ці зміни в Договорі вступають в силу одночасно з
            такими змінами в Оферті.</p>
        <p><span className={'font-bold'}>9.8.</span> Договір може бути розірваний за згодою Сторін в будь-який час або з інших підстав, передбачених цією
            Офертою і/або чинним Законодавством України.</p>
        <p><span className={'font-bold'}>9.9.</span> Усі спори та розбіжності, що можуть виникнути між сторонами за цим договором, вирішуються шляхом
            переговорів. У разі недосягнення згоди спори вирішуються в судовому порядку за місцезнаходженням Виконавця
            відповідно до чинного законодавства України.</p>
        <p><span className={'font-bold'}>9.10.</span> Сторони визнають, що документи, надіслані за допомогою Особистого кабінету чи іншими електронними
            засобами зв&apos;язку, мають юридичну силу, рівноцінну документам при звичайному паперовому документообігу.
            <span className={'font-bold'}>9.11</span>. У разі визнання будь-якого положення Оферти недійсним або неправочинним, це не впливає на дію інших
            положень Оферти.</p>
        <p><span className={'font-bold'}>9.12</span>. Оферта діє до повного виконання Сторонами своїх зобов&apos;язань.</p>
        <p><span className={'font-bold'}>9.13</span>. Офіційним джерелом інформування Замовника про Виконавця та послуги є:</p>
        <br/>

        • Telegram-канал Виконавця: <a className={'cta-link inline-flex items-center text-primary raspberry-color'}
                                       href={'https://t.me/yaninapopesko'}>Яніна Попеско Telegram</a><br/>
        • <a href="#" className={'cta-link inline-flex items-center text-primary raspberry-color'} onClick={(e) => {
        e.preventDefault()
        window.location.href = "mailto:" + atob("eWFuaW5hcG9wZXNrb0BnbWFpbC5jb20=") /// window.open("mailto:" + atob("eWFuaW5hcG9wZXNrb0BnbWFpbC5jb20="), '_blank', "noopener")?.focus();
    }}>Пошта Яніни Попеско</a><br/>

        • Instagram-аккаунт Виконавця: <a className={'cta-link inline-flex items-center text-primary raspberry-color'}
                                          href={'https://www.instagram.com/yanina_popesko/'}>Яніна Попеско
        Instagram</a>

    </div>)
}

export default Rules